Enums/НаправленияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интеркампани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
					<Comment>Внутри организации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>420</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНазначенияПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийПлательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ведомости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВедомостьВБанкЗарплатаКадры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедомостиПрочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВедомостьНаПеречислениеПрочихВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеречислениеНалоговВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПеречислениеНалоговВБюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ВзаиморасчетыССотрудникамиВХОЗУПК/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаиморасчеты с сотрудниками ВХО".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ЕстьОплатаПоВедомостиТекст(Ведомость, ТекстЗапроса) Экспорт
	
	МетаданныеДокумента = Ведомость.Метаданные();
	ИспользоватьЭОИ = Ложь;
	ЕстьРеквизитЗарплатныйПроект = ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗарплатныйПроект", МетаданныеДокумента);
	
	Если ЕстьРеквизитЗарплатныйПроект Тогда
		ЗарплатныйПроект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость, "ЗарплатныйПроект");
		ИспользоватьЭОИ = ОбменСБанкамиПоЗарплатнымПроектам.ИспользоватьЭОИСБанком(ЗарплатныйПроект);
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныйОбменСБанкамиПоЗарплатнымПроектам")
		ИЛИ НЕ ИспользоватьЭОИ Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПлатежноеПоручениеВедомости.Ссылка КАК ДокументПодтверждение
		|ИЗ
		|	Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ведомость = &Ведомость
		|	И ПлатежноеПоручение.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеВедомостиПрочие.Ссылка КАК ДокументПодтверждение
		|ИЗ
		|	Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеВедомостиПрочие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО ПлатежноеПоручениеВедомостиПрочие.Ссылка = ПлатежноеПоручение.Ссылка
		|ГДЕ
		|	ПлатежноеПоручениеВедомостиПрочие.Ведомость = &Ведомость
		|	И ПлатежноеПоручение.Проведен";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция СписокОплатТекст(Форма, ТекстЗапроса) Экспорт

	МетаданныеДокумента = Форма.Объект.Ссылка.Метаданные();
	ИспользоватьЭОИ = Ложь;
	ЕстьРеквизитЗарплатныйПроект = ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗарплатныйПроект", МетаданныеДокумента);
	
	Если ЕстьРеквизитЗарплатныйПроект Тогда
		ЗарплатныйПроект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.Ссылка, "ЗарплатныйПроект");
		ИспользоватьЭОИ = ОбменСБанкамиПоЗарплатнымПроектам.ИспользоватьЭОИСБанком(ЗарплатныйПроект);
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныйОбменСБанкамиПоЗарплатнымПроектам")
		ИЛИ НЕ ИспользоватьЭОИ Тогда
		
		Если Не ПравоДоступа("Чтение", Метаданные.Документы.ПлатежноеПоручение) Тогда
			Возврат ТекстЗапроса;
		КонецЕсли;	
		
		ИмяВедомости = МетаданныеДокумента.Имя;
		ИмяТЧ = "Зарплата";
		
		Если ИмяВедомости = "ВедомостьНаПеречислениеПрочихВыплат" Тогда
			
			ИмяТЧ = "ПрочиеВыплаты";
			
		ИначеЕсли ИмяВедомости = "ВедомостьПрочихДоходовВБанк"
			 ИЛИ ИмяВедомости = "ВедомостьПрочихДоходовПеречислением"
			 ИЛИ ИмяВедомости = "ВедомостьПрочихДоходовВКассу" Тогда
			
			ИмяТЧ = "Выплаты";
			
		КонецЕсли;		
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПлатежноеПоручениеВедомости.Ссылка КАК Регистратор,
			|	ДанныеВедомости.ФизическоеЛицо КАК ФизЛицо
			|ИЗ
			|	Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			|		ПО ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + ИмяВедомости + "." + ИмяТЧ + " КАК ДанныеВедомости
			|		ПО ПлатежноеПоручениеВедомости.Ведомость = ДанныеВедомости.Ссылка
			|ГДЕ
			|	ПлатежноеПоручениеВедомости.Ведомость = &Ведомость
			|	И ПлатежноеПоручение.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПлатежноеПоручениеВедомостиПрочие.Ссылка,
			|	ДанныеВедомости.ФизическоеЛицо
			|ИЗ
			|	Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеВедомостиПрочие
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			|		ПО ПлатежноеПоручениеВедомостиПрочие.Ссылка = ПлатежноеПоручение.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + ИмяВедомости + "." + ИмяТЧ + " КАК ДанныеВедомости
			|		ПО ПлатежноеПоручениеВедомостиПрочие.Ведомость = ДанныеВедомости.Ссылка
			|ГДЕ
			|	ПлатежноеПоручениеВедомостиПрочие.Ведомость = &Ведомость
			|	И ПлатежноеПоручение.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	Регистратор,
			|	ФизЛицо";
		
	Иначе
		
		Возврат ТекстЗапроса;
		
	КонецЕсли;

	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура ЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭД) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПеречислениеВзносовИОтчислений") Тогда
		РеквизитыИсточника = Новый Структура("Организация, БанковскийСчет");
		РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, РеквизитыИсточника);
        ПараметрыЭД.Направление = Перечисления.НаправленияЭДО.Исходящий;
		ПараметрыЭД.Организация = РеквизитыИсточника.Организация;
		ПараметрыЭД.Банк        = РеквизитыИсточника.БанковскийСчет.Банк;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.19";
    Обработчик.Процедура = "ВзаиморасчетыССотрудникамиВХОЗУПК.ОбновлениеВидПлатежаПеречислениеНалоговВБюджет";
    Обработчик.Идентификатор   = Новый УникальныйИдентификатор("ba90ea6f-bef8-4677-9e25-6ab979770e69");
    Обработчик.РежимВыполнения = "Отложенно";
    Обработчик.Комментарий = НСтр("ru = 'Заполнение вида платежа в документе ""Перечисление налогов в бюджет""'");
	
КонецПроцедуры	

Процедура ОбновлениеВидПлатежаПеречислениеНалоговВБюджет(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ПеречислениеНалоговВБюджет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеречислениеНалоговВБюджет КАК ПеречислениеНалоговВБюджет
		|ГДЕ
		|	ПеречислениеНалоговВБюджет.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПеречислениеНалоговВБюджет", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();

		ДокументОбъект.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

#КонецОбласти
